zup/ЗУП_бюджет/src/InformationRegisters/СвойстваДолжностейПедагогическихРаботников/СвойстваДолжностейПедагогическихРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваДолжностейПедагогическихРаботников</name>
  <resources>
    <name>ЯвляетсяПедагогическойДолжностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/InformationRegisters/НачисленияРаспределенияНагрузки/НачисленияРаспределенияНагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НачисленияРаспределенияНагрузки</name>
  <dimensions>
    <name>Начисление</name>
    <type>
      <types>ChartOfCalculationTypesRef.Начисления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/Enums/СпособыПримененияЗначенийПоказателейРасчетаЗарплаты/СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПримененияЗначенийПоказателейРасчетаЗарплаты</name>
  <enumValues>
    <name>Постоянное</name>
  </enumValues>
  <enumValues>
    <name>Разовое</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ТипыПоказателейРасчетаЗарплаты/ТипыПоказателейРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПоказателейРасчетаЗарплаты</name>
  <enumValues>
    <name>Денежный</name>
  </enumValues>
  <enumValues>
    <name>Числовой</name>
  </enumValues>
  <enumValues>
    <name>ЧисловойЗависящийОтДругогоПоказателя</name>
  </enumValues>
  <enumValues>
    <name>ЧисловойЗависящийОтСтажа</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ВидыТарифныхСтавок/ВидыТарифныхСтавок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТарифныхСтавок</name>
  <enumValues>
    <name>МесячнаяТарифнаяСтавка</name>
  </enumValues>
  <enumValues>
    <name>ЧасоваяТарифнаяСтавка</name>
  </enumValues>
  <enumValues>
    <name>ДневнаяТарифнаяСтавка</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/КатегорииНачисленийИНеоплаченногоВремени/КатегорииНачисленийИНеоплаченногоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииНачисленийИНеоплаченногоВремени</name>
  <enumValues>
    <name>ПовременнаяОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>СдельнаяОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ОплатаТрудаВНатуральнойФорме</name>
  </enumValues>
  <enumValues>
    <name>ДоходВНатуральнойФорме</name>
  </enumValues>
  <enumValues>
    <name>КомпенсационныеВыплаты</name>
  </enumValues>
  <enumValues>
    <name>Премия</name>
  </enumValues>
  <enumValues>
    <name>КвартальнаяПремия</name>
  </enumValues>
  <enumValues>
    <name>РайонныйКоэффициент</name>
  </enumValues>
  <enumValues>
    <name>СевернаяНадбавка</name>
  </enumValues>
  <enumValues>
    <name>УправленческийУчет</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеНаПериодОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеКомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ОплатаОтпуска</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЕдиновременнаяВыплатаКОтпускуГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>ЕдиновременнаяВыплатаКОтпуску</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощьПриОтпускеГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощьПриОтпуске</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>НеявкаПоБолезни</name>
  </enumValues>
  <enumValues>
    <name>НеявкаПоНевыясненнымПричинам</name>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботника</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПростояПоВинеРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПростояПоНезависящимОтРаботодателяПричинам</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеНаПериодКомандировки</name>
  </enumValues>
  <enumValues>
    <name>ОплатаКомандировки</name>
  </enumValues>
  <enumValues>
    <name>СохраняемоеДенежноеСодержание</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоСреднемуЗаработку</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработка</name>
  </enumValues>
  <enumValues>
    <name>ОплатаСверхурочныхВоеннослужащим</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодамВоеннослужащего</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоЛиста</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоЛистаЗаСчетРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоПрофзаболевание</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоНесчастныйСлучайНаПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработкаЗаДниБолезни</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеОплатаДнейУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ОплатаДнейУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоПолутораЛетВоеннослужащим</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоПолутораЛет</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоТрехЛет</name>
  </enumValues>
  <enumValues>
    <name>ВыходноеПособиеМесячноеДенежноеСодержание</name>
  </enumValues>
  <enumValues>
    <name>ВыходноеПособие</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаСовмещение</name>
  </enumValues>
  <enumValues>
    <name>БолезньБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодамБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗаработокНаВремяТрудоустройства</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощь</name>
  </enumValues>
  <enumValues>
    <name>Льгота</name>
  </enumValues>
  <enumValues>
    <name>ВыбираемаяСотрудникомЛьгота</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаВредность</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНаСанаторноКурортноеЛечение</name>
  </enumValues>
  <enumValues>
    <name>Отгул</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПредыдущимиДокументами</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоДенежногоСодержанияЗаДниБолезни</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаНеотработанныеДниЧасыПриУвольнении</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаНеотработанныеДниПриУвольненииГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>ДоначислениеДоУправленческогоУчета</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияМоральногоВреда</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ВидыРабочегоВремениСотрудников/ВидыРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРабочегоВремениСотрудников</name>
  <enumValues>
    <name>ОтработанноеВПределахНормы</name>
    <comment>Начисление за работу полную рабочую смену в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ОтработанноеСверхНормы</name>
    <comment>Начисление за работу сверх нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЦелодневноеНеотработанное</name>
    <comment>Неотработанные полные смены</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеНеотработанное</name>
    <comment>Неотработанные неполные смены</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительноОплачиваемоеВПределахНормы</name>
    <comment>Дополнительное начисление в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеОтработанноеВПределахНормы</name>
    <comment>Начисление за работу неполную смену в пределах нормы времени</comment>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/КатегорииСтажа/КатегорииСтажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииСтажа</name>
  <enumValues>
    <name>ВыслугаЛет</name>
  </enumValues>
  <enumValues>
    <name>Медицинский</name>
  </enumValues>
  <enumValues>
    <name>Непрерывный</name>
  </enumValues>
  <enumValues>
    <name>Общий</name>
  </enumValues>
  <enumValues>
    <name>ОбщийНаучноПедагогический</name>
  </enumValues>
  <enumValues>
    <name>Педагогический</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>РасширенныйСтраховой</name>
  </enumValues>
  <enumValues>
    <name>Северный</name>
  </enumValues>
  <enumValues>
    <name>Страховой</name>
  </enumValues>
  <enumValues>
    <name>ВыслугаЛетНаГосударственнойСлужбе</name>
  </enumValues>
  <enumValues>
    <name>ВыслугаЛетНаВоеннойСлужбе</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Documents/РаспределениеНагрузки/РаспределениеНагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспределениеНагрузки</name>
  <registerRecords>InformationRegister.УдалитьЗначенияСовокупныхТарифныхСтавокСотрудников</registerRecords>
  <registerRecords>InformationRegister.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</registerRecords>
  <registerRecords>InformationRegister.БухучетПлановыхНачислений</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисления</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленияСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияСНачислениямиИУдержаниями</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПересчетТарифныхСтавок</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СовокупнаяТарифнаяСтавка</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТарифнойСтавки</name>
      <type>
        <types>EnumRef.ВидыТарифныхСтавок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/Catalogs/ВидыСтажа/ВидыСтажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСтажа</name>
  <attributes>
    <name>КатегорияСтажа</name>
    <type>
      <types>EnumRef.КатегорииСтажа</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

zup/ЗУП_бюджет/src/CommonModules/ОбразовательныеУчреждения/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьСписокКонкурирующихПоПериодуРегистраторовНачислений(КонкурирующиеРегистраторы) Экспорт 
	
	КонкурирующиеРегистраторы.Добавить(Тип("ДокументСсылка.РаспределениеНагрузки")); 
	
КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РаспределениеНагрузки", "ДатаИзменения", "КадровыйУчет", "Организация");
	
КонецПроцедуры

Процедура ИсключитьНачисленияПедагогическихДолжностейИзПроверкиШтатногоРасписания(ДанныеОЗанятыхПозициях) Экспорт 
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВОбразовательномУчреждении") Тогда 
		Возврат;
	КонецЕсли;
	
	СписокПозиций = ОбщегоНазначения.ВыгрузитьКолонку(ДанныеОЗанятыхПозициях, "ПозицияШтатногоРасписания", Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СписокПозиций", СписокПозиций);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтатноеРасписание.Ссылка
	               |ИЗ
	               |	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейПедагогическихРаботников КАК СвойстваДолжностейПедагогическихРаботников
	               |		ПО ШтатноеРасписание.Должность = СвойстваДолжностейПедагогическихРаботников.Должность
	               |			И (ШтатноеРасписание.Ссылка В (&СписокПозиций))
	               |			И (СвойстваДолжностейПедагогическихРаботников.ЯвляетсяПедагогическойДолжностью)";
				   
	ПедагогическиеПозиции = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ПедагогическиеПозиции.Вставить(Выборка.Ссылка, Истина);
	КонецЦикла;
	
	ЭлементыДляУдаления = Новый Массив;
	Для Каждого ДанныеПозиции Из ДанныеОЗанятыхПозициях Цикл
		Если ПедагогическиеПозиции[ДанныеПозиции.ПозицияШтатногоРасписания] <> Неопределено Тогда
			ДанныеПозиции.ДанныеОНачислениях = Новый Массив;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьПоказателиОбразовательныхУчреждений(ПараметрыПланаВидовРасчета) Экспорт 
	
	РаботаВОбразовательномУчреждении = Константы.РаботаВОбразовательномУчреждении.Получить();
	ПараметрыПоказателей = ПараметрыПланаВидовРасчета.ПараметрыПоказателей;
	СозданныеЭлементы    = ПараметрыПланаВидовРасчета.СсылкиПоказателиРасчетаЗарплаты;
	
	Если ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы И РаботаВОбразовательномУчреждении Тогда 
		
		ОписаниеПоказателя = Справочники.ПоказателиРасчетаЗарплаты.ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "Педнагрузка";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Педнагрузка'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = 'Педнагрузка'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = 0;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		Справочники.ПоказателиРасчетаЗарплаты.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
		ОписаниеПоказателя = Справочники.ПоказателиРасчетаЗарплаты.ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "НормаПеднагрузки";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Норма педнагрузки'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = 'Норма педнагр.'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = 0;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		Справочники.ПоказателиРасчетаЗарплаты.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
		ОписаниеПоказателя = Справочники.ПоказателиРасчетаЗарплаты.ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ОкладПреподавателя";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Оклад преподавателя'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = 'Ставка'");
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = ПараметрыПоказателей.ОкладТарифТочность;
		ОписаниеПоказателя.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.МесячнаяТарифнаяСтавка;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		Справочники.ПоказателиРасчетаЗарплаты.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
		ОписаниеПоказателя = Справочники.ПоказателиРасчетаЗарплаты.ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "КлассноеРуководство";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Классное руководство'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = 'Классн. рук.'");
		ОписаниеПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = ПараметрыПоказателей.ОкладТарифТочность;
		ОписаниеПоказателя.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.МесячнаяТарифнаяСтавка;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		Справочники.ПоказателиРасчетаЗарплаты.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
		ОписаниеПоказателя = Справочники.ПоказателиРасчетаЗарплаты.ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "ПроверкаТетрадей";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Процент за тетради'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = '% тетради'");
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.Точность = 0;
		ОписаниеПоказателя.Предопределенный = Ложь;
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		Справочники.ПоказателиРасчетаЗарплаты.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьНачисленияОбразовательныхУчреждений(ПараметрыПланаВидовРасчета, СвойстваНачислений, КоллекторНачислений) Экспорт 
	
	РаботаВОбразовательномУчреждении = Константы.РаботаВОбразовательномУчреждении.Получить();
	
	Описание = ПланыВидовРасчета.Начисления.ОписаниеНачисления();
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда;
	Описание.СвойстваПоКатегории 		= СвойстваНачислений[Описание.КатегорияНачисленияИлиНеоплаченногоВремени];
	Описание.Код						= НСтр("ru = 'ОКЛПР'");
	Описание.Наименование				= НСтр("ru = 'Оплата преподавателей по окладу'");
	Описание.КраткоеНаименование 		= НСтр("ru = 'Оклад преп.'");
	Описание.ФормулаРасчета 			= "ОкладПреподавателя * Педнагрузка / НормаПеднагрузки * ВремяВДнях / НормаДней";
	Описание.ВидВремени 				= Перечисления.ВидыРабочегоВремениСотрудников.ОтработанноеВПределахНормы;
	Описание.ОбозначениеВТабелеУчетаРабочегоВремени = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Явка");
	Описание.НачисляетсяПриРасчетеПервойПоловиныМесяца = Истина;
	ЗапрашиваемыеПоказатели				= Новый Массив;;
	ЗапрашиваемыеПоказатели.Добавить("ОкладПреподавателя");
	ЗапрашиваемыеПоказатели.Добавить("Педнагрузка");
	ЗапрашиваемыеПоказатели.Добавить("НормаПеднагрузки");
	Описание.ЗапрашиваемыеПоказатели 	= ЗапрашиваемыеПоказатели;
	Описание.СсылкаНаОбъект 			= ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ОплатаПреподавателейПоОкладу;
	Описание.КлючевыеСвойства 			= "Ссылка";
	Если ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы И РаботаВОбразовательномУчреждении Тогда
		ПланыВидовРасчета.Начисления.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
		ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ОплатаПреподавателейПоОкладу = Описание.СсылкаНаОбъект;
	ИначеЕсли ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы Тогда
		Описание.Вставить("Ссылка", Описание.СсылкаНаОбъект);
		ПланыВидовРасчета.Начисления.ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;
	
	Описание = ПланыВидовРасчета.Начисления.ОписаниеНачисления();
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда;
	Описание.СвойстваПоКатегории 	= СвойстваНачислений[Описание.КатегорияНачисленияИлиНеоплаченногоВремени];
	Описание.Код					= НСтр("ru = 'КЛРУК'");
	Описание.Наименование			= НСтр("ru = 'Доплата за классное руководство'");
	Описание.КраткоеНаименование 	= НСтр("ru = 'Доплата классн. рук.'");
	Описание.ФормулаРасчета 		= "КлассноеРуководство * ВремяВДнях / НормаДней";
	Описание.ВидВремени 			= Перечисления.ВидыРабочегоВремениСотрудников.ДополнительноОплачиваемоеВПределахНормы;
	Описание.ОбозначениеВТабелеУчетаРабочегоВремени = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Явка");
	Описание.НачисляетсяПриРасчетеПервойПоловиныМесяца = Истина;
	Описание.ЗапрашиваемыеПоказатели  = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("КлассноеРуководство");
	Описание.СсылкаНаОбъект 		= ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ДоплатаЗаКлассноеРуководство;
	Описание.КлючевыеСвойства 		= "Ссылка";
	Если ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы И РаботаВОбразовательномУчреждении Тогда
		ПланыВидовРасчета.Начисления.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
		ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ДоплатаЗаКлассноеРуководство = Описание.СсылкаНаОбъект;
	ИначеЕсли ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы Тогда
		Описание.Вставить("Ссылка", Описание.СсылкаНаОбъект);
		ПланыВидовРасчета.Начисления.ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;
	
	Описание = ПланыВидовРасчета.Начисления.ОписаниеНачисления();
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда;
	Описание.СвойстваПоКатегории 	= СвойстваНачислений[Описание.КатегорияНачисленияИлиНеоплаченногоВремени];
	Описание.Код					= НСтр("ru = 'ПРТЕТ'");
	Описание.Наименование			= НСтр("ru = 'Доплата за проверку тетрадей'");
	Описание.КраткоеНаименование 	= НСтр("ru = 'Доплата пров. тетр.'");
	Описание.ФормулаРасчета 		= "РасчетнаяБаза * ПроверкаТетрадей / 100";
	Описание.ВидВремени 			= Перечисления.ВидыРабочегоВремениСотрудников.ДополнительноОплачиваемоеВПределахНормы;
	Описание.НачисляетсяПриРасчетеПервойПоловиныМесяца = Истина;
	Описание.ЗапрашиваемыеПоказатели  = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ПроверкаТетрадей");
	Описание.ОтборБазовых 			= Неопределено;
	Описание.СсылкаНаОбъект 		= ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ДоплатаЗаПроверкуТетрадей;
	Описание.КлючевыеСвойства 		= "Ссылка";
	Если ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы И РаботаВОбразовательномУчреждении Тогда
		ПланыВидовРасчета.Начисления.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
		ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ДоплатаЗаПроверкуТетрадей = Описание.СсылкаНаОбъект;
		НачислениеОбъект = КоллекторНачислений[Описание.СсылкаНаОбъект];
		Если НачислениеОбъект <> Неопределено И НачислениеОбъект.ДополнительныеСвойства.Свойство("ОтборБазовых") Тогда 
			НачислениеОбъект.ДополнительныеСвойства.ОтборБазовых = Неопределено;
			Если НачислениеОбъект.БазовыеВидыРасчета.Найти(ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ОплатаПреподавателейПоОкладу, "ВидРасчета") = Неопределено Тогда 
				НачислениеОбъект.БазовыеВидыРасчета.Добавить().ВидРасчета = ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ОплатаПреподавателейПоОкладу;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы Тогда
		Описание.Вставить("Ссылка", Описание.СсылкаНаОбъект);
		ПланыВидовРасчета.Начисления.ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНачисленияРаспределенияНагрузки(ПараметрыПланаВидовРасчета) Экспорт 
	
	РаботаВОбразовательномУчреждении = Константы.РаботаВОбразовательномУчреждении.Получить();
	
	Если ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы И РаботаВОбразовательномУчреждении Тогда
		
		ОплатаПреподавателейПоОкладу = ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ОплатаПреподавателейПоОкладу;
		Если ЗначениеЗаполнено(ОплатаПреподавателейПоОкладу) Тогда 
			НаборЗаписей = РегистрыСведений.НачисленияРаспределенияНагрузки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Начисление.Установить(ОплатаПреподавателейПоОкладу);
			НаборЗаписей.Добавить().Начисление = ОплатаПреподавателейПоОкладу;
			НаборЗаписей.Записать();
		КонецЕсли;
		
		ДоплатаЗаКлассноеРуководство = ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ДоплатаЗаКлассноеРуководство;
		Если ЗначениеЗаполнено(ДоплатаЗаКлассноеРуководство) Тогда 
			НаборЗаписей = РегистрыСведений.НачисленияРаспределенияНагрузки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Начисление.Установить(ДоплатаЗаКлассноеРуководство);
			НаборЗаписей.Добавить().Начисление = ДоплатаЗаКлассноеРуководство;
			НаборЗаписей.Записать();
		КонецЕсли;
		
		ДоплатаЗаПроверкуТетрадей = ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний.ДоплатаЗаПроверкуТетрадей;
		Если ЗначениеЗаполнено(ДоплатаЗаПроверкуТетрадей) Тогда 
			НаборЗаписей = РегистрыСведений.НачисленияРаспределенияНагрузки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Начисление.Установить(ДоплатаЗаПроверкуТетрадей);
			НаборЗаписей.Добавить().Начисление = ДоплатаЗаПроверкуТетрадей;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьФормуЭлементаСправочникаДолжности(Форма, ИмяГруппы = "ГруппаПедагогическаяДолжность") Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВОбразовательномУчреждении") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СвойстваДолжностейПедагогическихРаботников", 
		Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.СвойстваДолжностейПедагогическихРаботников"), , , Истина));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
	Элементы = Форма.Элементы;
	ГруппаФормы = Элементы.Найти(ИмяГруппы); 
	
	Если Элементы.Найти("ЯвляетсяПедагогическойДолжностью") = Неопределено Тогда
		ПолеПедагогическаяДолжность = Элементы.Добавить("ЯвляетсяПедагогическойДолжностью", Тип("ПолеФормы"), ГруппаФормы);
		ПолеПедагогическаяДолжность.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеПедагогическаяДолжность.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		ПолеПедагогическаяДолжность.ПутьКДанным = "СвойстваДолжностейПедагогическихРаботников.ЯвляетсяПедагогическойДолжностью";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьДополнительныеДанныеДолжности(Форма) Экспорт	
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВОбразовательномУчреждении") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СвойстваДолжностейПедагогическихРаботников) Тогда
		Возврат;
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.СвойстваДолжностейПедагогическихРаботников.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Должность = Форма.Объект.Ссылка;
	МенеджерЗаписи.Прочитать();
	
	ЗначениеВДанныеФормы(МенеджерЗаписи, Форма.СвойстваДолжностейПедагогическихРаботников);
	
КонецПроцедуры

Процедура ЗаписатьДополнительныеДанныеДолжности(Форма, Ссылка) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВОбразовательномУчреждении") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СвойстваДолжностейПедагогическихРаботников) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СвойстваДолжностейПедагогическихРаботников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Должность.Установить(Ссылка);
	
	Запись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, Форма.СвойстваДолжностейПедагогическихРаботников);
	Запись.Должность = Ссылка;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.АвтоматическийРасчетСтажейФизическихЛиц") Тогда
		
		МодульАвтоматическийРасчетСтажейФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("АвтоматическийРасчетСтажейФизическихЛиц");
		МодульАвтоматическийРасчетСтажейФизическихЛиц.УстановитьДополнительноеСвойствоПропуститьОбновлениеЗависимыхСтажей(НаборЗаписей.ДополнительныеСвойства);
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Получение настроек начислений для редактирования настроек особенностей предприятия.
Функция НачисленияРаспределенияНагрузки() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Начисление,
	|	ВЫБОР
	|		КОГДА НачисленияРаспределенияНагрузки.Начисление ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Выбрано
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачисленияРаспределенияНагрузки КАК НачисленияРаспределенияНагрузки
	|		ПО Начисления.Ссылка = НачисленияРаспределенияНагрузки.Начисление
	|ГДЕ
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Начисления.РеквизитДопУпорядочивания";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции 

// Сохранение настроек из формы редактирования настроек особенностей предприятия
Процедура ЗаписатьНастройкиОбразовательногоУчреждения(Настройки) Экспорт
	
	Константы.РаботаВОбразовательномУчреждении.Установить(Настройки.РаботаВОбразовательномУчреждении);
	
	НаборЗаписей = РегистрыСведений.НачисленияРаспределенияНагрузки.СоздатьНаборЗаписей();
	Для каждого СтрокаТЗ Из Настройки.НачисленияПреподавателей Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(),СтрокаТЗ);
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры

Функция НастройкиПрограммыБюджетногоУчреждения(НастройкиПрограммы) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаКонстант = "РаботаВОбразовательномУчреждении";
	Настройка = Константы.СоздатьНабор(СтрокаКонстант);
	Настройка.Прочитать();
	ЗаполнитьЗначенияСвойств(НастройкиПрограммы, Настройка, СтрокаКонстант);

КонецФункции

Процедура ЗаписатьНастройкиНачальнаяНастройкаПрограммы(Параметры) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда
		Возврат;
	КонецЕсли;
	
	Константы.РаботаВОбразовательномУчреждении.Установить(Параметры.ПараметрыПрограммы.РаботаВОбразовательномУчреждении);

КонецПроцедуры

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.РаспределениеНагрузки);
	
КонецПроцедуры

Процедура ДополнитьВидамиСтажаДолжностей(Должность, ВидыСтажаДолжностей) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("РаботаВОбразовательномУчреждении") Тогда
		
		Запрос = Новый Запрос;
		
		Если ТипЗнч(Должность) = Тип("СправочникСсылка.ШтатноеРасписание") Тогда
			Запрос.УстановитьПараметр("Должность", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Должность, "Должность"));
		Иначе
			Запрос.УстановитьПараметр("Должность", Должность);
		КонецЕсли;
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СвойстваДолжностейПедагогическихРаботников.ЯвляетсяПедагогическойДолжностью КАК ЯвляетсяПедагогическойДолжностью
			|ИЗ
			|	РегистрСведений.СвойстваДолжностейПедагогическихРаботников КАК СвойстваДолжностейПедагогическихРаботников
			|ГДЕ
			|	СвойстваДолжностейПедагогическихРаботников.Должность = &Должность
			|	И СвойстваДолжностейПедагогическихРаботников.ЯвляетсяПедагогическойДолжностью";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыСтажаДолжностей, ВидыСтажейДолжностейСАвтоматическимПрерываниемРоста());
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДолжностиСАвтоматическимУчетомПрерыванияСтажей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СвойстваДолжностейПедагогическихРаботников.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.СвойстваДолжностейПедагогическихРаботников КАК СвойстваДолжностейПедагогическихРаботников
		|ГДЕ
		|	СвойстваДолжностейПедагогическихРаботников.ЯвляетсяПедагогическойДолжностью";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Должность");
	
КонецФункции

Функция ВидыСтажейПоСвойствамДолжностиФормы(Форма) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВОбразовательномУчреждении") Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат ВидыСтажейПоСвойствамДолжностей(Форма.СвойстваДолжностейПедагогическихРаботников);
	
КонецФункции

Функция ВидыСтажейПоСвойствамДолжностей(СвойствамДолжностей) Экспорт
	
	Если СвойствамДолжностей.ЯвляетсяПедагогическойДолжностью Тогда
		ВидыСтажаДолжностей = ВидыСтажейДолжностейСАвтоматическимПрерываниемРоста();
	Иначе
		ВидыСтажаДолжностей = Новый Массив;
	КонецЕсли;
	
	Возврат ВидыСтажаДолжностей;
	
КонецФункции

Функция ВидыСтажейДолжностейСАвтоматическимПрерываниемРоста() Экспорт
	
	КатегорииСтажа = Новый Массив;
	КатегорииСтажа.Добавить(Перечисления.КатегорииСтажа.Педагогический);
	КатегорииСтажа.Добавить(Перечисления.КатегорииСтажа.ОбщийНаучноПедагогический);
	
	Возврат Справочники.ВидыСтажа.ВидыСтажаПоКатегориям(КатегорииСтажа);
	
КонецФункции

#КонецОбласти
